<template>
  <div>
    <!--
      webpack 是一个前端模块化打包工具

      前端模块化
       目前使用前端模块化的一些方案:AMD,CMD,CommomJS,ES6;(浏览器只支持ES6,其余的不支持,不过在webpack中可使用)
       在ES6之前,我们要想进行模块化开发,就必须借助于其他的工具,让我们可以进行模块化开发,并且在通过模块化开发完成项目后,还需要处理模块间的各种依赖,将其进行整合打包;
       webpack其中一个核心功能就是让我们可以进行模块化开发,并且帮助我们处理模块之间的依赖关系,处理成浏览器能识别的js代码,而且不仅仅是js文件,css,图片,json文件等等在webpack中都可以被当做模块来使用

      webpack可以帮助我们进行模块化,并且处理模块之间的复杂关系
      打包:就是将webpack中的各种资源模块打包合并成一个或多个包,并且在打包的过程中,对资源进行处理,比如压缩图片,将scss转成css,将ES6语法转成ES5语法,将ts转成js

      webpack和grunt/gulp的对比:
        grunt/gulp的核心是任务流,通过配置一系列的任务,并且定义任务要处理的事务(例如ES6,ts转化,图片压缩,scss转css),然后让grunt/gulp依次执行这些任务,来让整个流程自动化,所以grunt/gulp也被称为前端自动化任务管理工具

      什么时候用grunt/gulp?
        如果工程模块依赖非常简单,甚至没有模块化概念时

      所以grunt/gulp有什么不同呢?
        grunt/gulp更强调的是前端流程的自动化,模块化不是它的核心
        webpack更强调模块化开发管理,而文件压缩合并,预处理等功能,是它附带的功能
     -->

    <!--

      -->
  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>
